
// Напишите программу, которая выдает квадрат входящего числа

Console.WriteLine("Write a number: ");

int num = int.Parse(Console.ReadLine()!);

Console.WriteLine(num * num);
